# CannotFinalizeOrphanSerf Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotFinalizeOrphanSerf Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Can't finalize Group member without finalizing the entire Group.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotFinalizeOrphanSerf { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotFinalizeOrphanSerf As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotFinalizeOrphanSerf {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace